app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    #Obtiene todos los registros SELECT * FROM articles
    @articles = Article.all

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 0], ["updated_at", "2017-12-05 22:13:09.439818"], ["id", 4]]
---
  def show
    #Encontrar un registro por id
    @article.update_visits_count

INSERT INTO "articles" ("title", "body", "visits_count", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Siguiente post"], ["body", "Ya se agregan las visitas"], ["visits_count", 0], ["created_at", "2017-12-05 22:14:51.932195"], ["updated_at", "2017-12-05 22:14:51.932195"], ["user_id", 1]]
INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 9], ["category_id", 1], ["created_at", "2017-12-13 21:38:29.938360"], ["updated_at", "2017-12-13 21:38:29.938360"]]
---
  def create
    #INSERT INTO
    @article = current_user.articles.new(article_params)
    @article.categories = params[:categories]

    if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
---
  def destroy
    #DELETE FROM articles
    @article.destroy

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Aqui es donde pruebo ajax... No jalo"], ["updated_at", "2017-12-11 21:20:39.586744"], ["id", 7]]
---
  def update
    #UPDATE
    # @article.update_attributes({title: 'Nuevo titulo'})
    if @article.update(article_params)