app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article

    respond_to do |format|
      p '--------------------------- before save'
      if @comment.save
---
INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 6], ["body", "Fuck You"], ["created_at", "2017-12-06 19:27:04.041446"], ["updated_at", "2017-12-06 19:27:04.041446"]]